In [16]:
# 간단한 함수 만들기
def my_sq(x): return x ** 2
def my_exp(x, n): return x ** n

print(my_sq(4))
print(my_exp(2, 4))

16
16

In [36]:
# apply 메서드 사용하기 - 기초
import pandas as pd

df = pd.DataFrame({'a': [10,20,30], 'b': [20,30,40]})
print(df)
print('---------')
print(df['a']**2)

    a   b
0  10  20
1  20  30
2  30  40
---------
0    100
1    400
2    900
Name: a, dtype: int64

In [37]:
sq=df['a'].apply(my_sq)
print(sq)
print('----------')

ex = df['a'].apply(my_exp, n=2)
print(ex)
print('----------')

ex = df['a'].apply(my_exp, n=3)
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64
----------
0    100
1    400
2    900
Name: a, dtype: int64
----------
0     1000
1     8000
2    27000
Name: a, dtype: int64

In [38]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [39]:
def print_me(x):
    print(x)

print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [40]:
def avg_3(x,y,z):
    return (x + y + z) / 3

# print(df.apply(avg_3)) 오류

In [44]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

In [5]:
def avg_3_apply(col):
    sum = 0
    for item in col:
        sum += item
    return sum / df.shape[0]

In [42]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

print(df.apply(avg_2_apply, axis=1))

0    15.0
1    25.0
2    35.0
dtype: float64

In [43]:
# apply 메서드 사용하기 - 고급

In [9]:
import numpy as np
import pandas as pd

In [6]:
import seaborn as sns

# 데이터 로딩 => titanic dataset
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [8]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [10]:
titanic.isnull().sum() # 컬럼별 NaN 개수 확인

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
# 1. line 설명 코드
pd.isnull(titanic['age'])

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [12]:
# import numpy as np

def count_missing(vec): # vec = column
    null_vec = pd.isnull(vec) # 1. T/F vec
    null_count = np.sum(null_vec) # 2. True=>1, False=>0, True(NAN) count
    return null_count

cmis_col = titanic.apply(count_missing) # , axis=0)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [24]:
def prop_complete(vec):
    return 1 - prop_missing(vec) # prop_missing(vec) 결측치 비율

cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

print(cmis_row.head())
print('-------------')
print(pmis_row.head())
print('-------------')
print(pcom_row.head())
print('-------------')
print(cmis_row)
print('-------------')
print(pmis_row)
print('-------------')
print(pcom_row)

0    1
1    0
2    1
3    0
4    1
dtype: int64
-------------
0    0.0625
1    0.0000
2    0.0625
3    0.0000
4    0.0625
dtype: float64
-------------
0    0.9375
1    1.0000
2    0.9375
3    1.0000
4    0.9375
dtype: float64
-------------
0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64
-------------
0      0.0625
1      0.0000
2      0.0625
3      0.0000
4      0.0625
        ...
886    0.0625
887    0.0000
888    0.1250
889    0.0000
890    0.0625
Length: 891, dtype: float64
-------------
0      0.9375
1      1.0000
2      0.9375
3      1.0000
4      0.9375
        ...
886    0.9375
887    1.0000
888    0.8750
889    1.0000
890    0.9375
Length: 891, dtype: float64

In [21]:
print(titanic.apply(count_missing))
print('-------------')
print(titanic.apply(prop_missing))
print('-------------')
print(titanic.apply(prop_complete))

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
-------------
survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64
-------------
survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [37]:
# display option 전체 행열 표시
pd.set_option('display.max_columns', 20) # , None) => 전체 컬럼 표시
pd.set_option('display.max_rows', 20) # , None) => 전체 행 표시

In [38]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [29]:
titanic['num_missing']=titanic.apply(count_missing, axis=1)
print(titanic.head())
print('-------------------------')
print(titanic.iloc[0,9:4]) # num_missing 만 추출

   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1
-------------------------
Series([], Name: 0, dtype: object)

In [23]:
print(titanic.loc[titanic.num_missing > 1, :].sample(10))

     survived  pclass     sex  age  sibsp  parch     fare embarked   class
277         0       2    male  NaN      0      0   0.0000        S  Second  \
368         1       3  female  NaN      0      0   7.7500        Q   Third
126         0       3    male  NaN      0      0   7.7500        Q   Third
828         1       3    male  NaN      0      0   7.7500        Q   Third
36          1       3    male  NaN      0      0   7.2292        C   Third
107         1       3    male  NaN      0      0   7.7750        S   Third
26          0       3    male  NaN      0      0   7.2250        C   Third
240         0       3  female  NaN      1      0  14.4542        C   Third
584         0       3    male  NaN      0      0   8.7125        C   Third
517         0       3    male  NaN      0      0  24.1500        Q   Third

       who  adult_male deck  embark_town alive  alone  num_missing
277    man        True  NaN  Southampton    no   True            2
368  woman       False  NaN   Queenstown   yes   True            2
126    man        True  NaN   Queenstown    no   True            2
828    man        True  NaN   Queenstown   yes   True            2
36     man        True  NaN    Cherbourg   yes   True            2
107    man        True  NaN  Southampton   yes   True            2
26     man        True  NaN    Cherbourg    no   True            2
240  woman       False  NaN    Cherbourg    no  False            2
584    man        True  NaN    Cherbourg    no   True            2
517    man        True  NaN   Queenstown    no   True            2